/**
 ***********************************************************************************************
 * @file          
 * @author        neale
 * @version       V1.0
 * @date          2024-06-27
 * @brief         定义使用的索引表，参数表和数据表
 * @license       Copyright (c) 2024-2048, 西安兰特水电测控技术有限责任公司
 **********************************************************************************************
 * @attention 
 * 
 * Modified Records
 * 
 ***********************************************************************************************
*/
#include "test.h"

/*定义数据存储数组*/

MSR_FRE             msr_fre_value[MAX_SEN];                     //渗压计存储数组
MSR_RESISTANCE      msr_resistance_value[MAX_SEN];              //差阻存储数组
float               msr_current_value[MAX_SEN];                 //标准电流存储数组
MSR_OTHER           msr_other_value[MAX_SEN/2];                 //其它测量值存储数组
MSR_ENVIRONMENT     msr_environment_value;                      //环境量存储结构体
int                 msr_rain_value;                             //雨量变量


/** 定义参数数组 */
PHYSICS         para_phy_tbl[600];                  /**< 物理量表 */
TUN_CONFIG      para_tun_tbl[16];                   /**< 通道配置表 */
PHY_REL_PARA    para_andphy_tbl[300];               /**< 参数物理量关系表 */
PHY_MONITOR     para_monitor_tbl[100];              /**< 监测项目物理量关系表 */



index_table_t globalTables;             //声明     指向索引表类型的指针


uint8_t command_value[12];                 /**< 定义命令值表，每一位代表一个命令 */ 

/*****************************************************************************************
*   @attention          命令值表说明
*   位号  起始地址        数组中位置               位号  起始地址        数组中位置
*   第0位，00001，command_value[0] & 0x01         第08位，00009，command_value[1] & 0x01    
*   第1位，00002，command_value[0] & 0x02         第09位，00010，command_value[1] & 0x02    
*   第2位，00003，command_value[0] & 0x04         第10位，00011，command_value[1] & 0x04    
*   第3位，00004，command_value[0] & 0x08         第11位，00012，command_value[1] & 0x08    
*   第4位，00005，command_value[0] & 0x10         第12位，00013，command_value[1] & 0x10    
*   第5位，00006，command_value[0] & 0x20         第13位，00014，command_value[1] & 0x20    
*   第6位，00007，command_value[0] & 0x40         第14位，00015，command_value[1] & 0x40    
*   第7位，00008，command_value[0] & 0x80         第15位，00016，command_value[1] & 0x80    
******************************************************************************************/

cmd_para cmd_para_tbl[CMD_MAX];                 /**< 建立命令参数表 */

/**
******************************************************************************************
 * @attention
 * 
*   ——————————————————————————————————————————————————————
*   |          ID       | 位号 | 角色 |模块类型|操作类型|从站地址|功能码|起始地址|等待时间|        说明        |
*   ——————————————————————————————————————————————————————
*   |  cmd_para_tbl[0]  |  01  |  01  |   4    |   01   |   03   | 0x05 | 0001   |   10   |      测量命令1     |
*   ——————————————————————————————————————————————————————
******************************************************************************************
*/

