/**
 ***********************************************************************************************
 * @file          usr_gpio.c
 * @author        neale
 * @version       
 * @date          
 * @brief         
 * @license       Copyright (c) 2024-2048, 西安兰特水电测控技术有限责任公司
 **********************************************************************************************
 * @attention 
 * 
 * Modified Records
 * 
 ***********************************************************************************************
*/

#include "usr_gpio.h"

/**
 **********************************************************************
 * @brief      配置引脚为输出模式
 * @param      
 * @param      
 * @retval     无返回值
 **********************************************************************
 */
void usr_gpio_init()
{
    rt_pin_mode(PWR1_PIN, PIN_MODE_OUTPUT);
    rt_pin_mode(PWR2_PIN, PIN_MODE_OUTPUT);
    rt_pin_mode(PWR3_PIN, PIN_MODE_OUTPUT);
    rt_pin_mode(PWR4_PIN, PIN_MODE_OUTPUT);
}


/**
 **********************************************************************
 * @brief      打开控制电源
 * @param[in]      引脚编号
 * @param      
 * @retval     
 **********************************************************************
 */
void power_on(rt_base_t pin)
{
    rt_pin_write(pin, PIN_HIGH);
}

/**
 **********************************************************************
 * @brief      关闭控制电源
 * @param[in]      引脚编号
 * @param      
 * @retval     
 **********************************************************************
 */
void power_off(rt_base_t pin)
{
    rt_pin_write(pin, PIN_LOW);
}
